; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph3 - mode
	thermograph4 - mode
	spectrograph1 - mode
	image2 - mode
	image5 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star5 - direction
	Star7 - direction
	Star8 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation9 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(supports instrument0 image2)
	(supports instrument0 image5)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(pointing satellite0 Planet14)
	(have_image Planet14 thermograph0)
	(have_image Planet14 spectrograph3)
	(have_image Planet15 thermograph4)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 thermograph0)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 phenomenon16 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 7
3. (turn_to satellite0 star4 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star4)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite0 phenomenon16 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 7
6. (take_image satellite0 phenomenon16 instrument0 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 1 of 7
7. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 7
8. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 7
9. (turn_to satellite0 planet14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet14)
   goals met: 3 of 7
10. (take_image satellite0 planet14 instrument0 spectrograph3)
   added: (have_image planet14 spectrograph3)
   goals met: 4 of 7
11. (take_image satellite0 planet14 instrument0 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 5 of 7
12. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 4 of 7
13. (take_image satellite0 planet15 instrument0 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 5 of 7
14. (take_image satellite0 planet15 instrument0 thermograph4)
   added: (have_image planet15 thermograph4)
   goals met: 6 of 7
15. (turn_to satellite0 planet14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet14)
   goals met: 7 of 7
